/*
*********************************************************************************************************
*    @Brief   : 数据观察点与跟踪(DWT)模块
*    @Name    : bsp_dwt.c
*    @Version : V1.0
*    @Note    : DWT驱动
*    @Logs    :
*    Date            Author       Notes
*    2021-08-19      Walker       Initial version.
*    Copyright (c) 2021, <m18962063673@163.com>
*********************************************************************************************************
*/

#include "bsp.h"

/*
*********************************************************************************************************
*                                             寄存器                                                    
*********************************************************************************************************
*/
#define  DEM_CR_TRCENA               (1 << 24)
#define  DWT_CR_CYCCNTENA            (1 <<  0)

/*
*********************************************************************************************************
 * @brief       bsp_InitDWT
 * @note        初始化DWT
 * @param[in]   none
 * @return      none
*********************************************************************************************************
*/
void bsp_InitDWT(void)
{
    DEM_CR         |= (unsigned int)DEM_CR_TRCENA;
    DWT_CYCCNT      = (unsigned int)0u;
    DWT_CR         |= (unsigned int)DWT_CR_CYCCNTENA;
}

/*
*********************************************************************************************************
 * @brief       bsp_DelayUS
 * @note        采用CPU的内部计数实现us延时
 * @param[in]   _ulDelayTime - 延迟长度,单位1 us
 * @return      none
*********************************************************************************************************
*/
void bsp_DelayUS(uint32_t _ulDelayTime)
{
    uint32_t tCnt, tDelayCnt;
    uint32_t tStart;

    tStart = DWT_CYCCNT;  /* 刚进入时的计数器值 */
    tCnt = 0;
    tDelayCnt = _ulDelayTime * (SystemCoreClock / 1000000); /* 需要的节拍数 */

    while(tCnt < tDelayCnt)
    {
        tCnt = DWT_CYCCNT - tStart; /* 求减过程中，如果发生第一次32位计数器重新计数，依然可以正确计算 */
    }
}

/*
*********************************************************************************************************
 * @brief       bsp_DelayMS
 * @note        采用CPU的内部计数实现ms延时
 * @param[in]   _ulDelayTime - 延迟长度,单位1 ms
 * @return      none
*********************************************************************************************************
*/
void bsp_DelayMS(uint32_t _ulDelayTime)
{
    bsp_DelayUS(1000*_ulDelayTime);
}
